export const ERROR_MESSAGES: Record<number, string> = {
    1: "Неверный формат почты! Должно быть например: mail@mail.ru",
    2: "Неудалось авторизоваться!",
    3: "Длина имени мин. - 4 символа, максимум - 32",
    4: "Длина пароля мин. - 8 символа, максимум - 32",
    5: "Пароли не совпадают",
    6: "Не удалось обновить данные",
    7: "Не во всех вопросах указан верный ответ",
    8: "У вопроса должно быть 4 варианта ответа",
    9: "Не удалось добавить ответ",
    10: "Введите ответ",
    11: "Не удалось опубликовать",
    12: "Длина названия квиза должна быть от 1 до 64 символов",
    13: "Диапазон времени от 20 до 60 сек",
    14: "Диапазон повреждения от 1 до 30",
    15: "Диаппазон значения награды от 1 до 100",
    16: "Длина вопроса от 4 до 256 символов",

}